
#Область ПрограммныйИнтерфейс

Процедура ВывестиСообщенияДлительнойОперации(ИдентификаторЗадания, ИдентификаторФормы = Неопределено) Экспорт
	
	ДлительныеОперацииРазрешения1C.ВывестиСообщенияДлительнойОперации(ИдентификаторЗадания, ИдентификаторФормы);
	
КонецПроцедуры

Функция ВыполнитьВФоне(Знач ИмяПроцедуры, Знач ПараметрыПроцедуры, Знач ПараметрыВыполнения) Экспорт
		
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

Функция ПараметрыВыполненияВФоне(Знач ИдентификаторФормы) Экспорт
	
	Возврат ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	
КонецФункции

#КонецОбласти


