
#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
Процедура СформироватьНаименование()
	
	Объект.Наименование = "" + СокрЛП(Объект.НомерДоверенности) + " от " + Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy") + " до " + Формат(Объект.ДатаОкончания, "ДФ=dd.MM.yyyy");
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НомерДоверенностиПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

#КонецОбласти
