
&НаСервере
Функция ПолучитьНаСервере(Разрешение)
Отчет = Отчеты.ОтчетДляТаможниНаДату1.Создать();
	
Схема               = Отчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); 
КомпоновщикМакета   = Новый КомпоновщикМакетаКомпоновкиДанных;  
КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
ПроцессорВывода     = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;    
ТабДок              = Новый ТабличныйДокумент;




ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема); 
КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);

Настройки   = Схема.НастройкиПоУмолчанию;
насРазрешение = Настройки.ПараметрыДанных.Элементы.Найти("Разрешение"); 
насРазрешение.Использование = Истина;
насРазрешение.Значение = Разрешение; 

насПериод = Настройки.ПараметрыДанных.Элементы.Найти("Период");
насПериод.Использование = Истина;
НасПериод.Значение = Объект.ДатаВывоза;

Макет       = КомпоновщикМакета.Выполнить(Схема, Настройки);    
ПроцессорКомпоновки.Инициализировать(Макет,,,Истина); 
ПроцессорВывода.УстановитьДокумент(ТабДок); 
ПроцессорВывода.Вывести(ПроцессорКомпоновки);

Возврат ТабДок;

КонецФункции

&НаКлиенте
Процедура Получить(Команда)
	Если Объект.Разрешение = Документы.Разрешения.ПустаяСсылка() тогда
	МассивРазрешений = ПолучитьРазрешения();
	
	Для Каждого Разрешение из МассивРазрешений Цикл
	ТабДок = Новый ТабличныйДокумент;
	Табдок = ПолучитьНаСервере(Разрешение);
	Табдок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Табдок.АвтоМасштаб = Истина;
	
	Область = ТабДок.НайтиТекст("Параметры");
	Смещать = ТипСмещенияТабличногоДокумента.ПоГоризонтали;
	ТабДок.УдалитьОбласть(Область, Смещать);
	
    Смещать = ТипСмещенияТабличногоДокумента.ПоГоризонтали;
	ТабДок.УдалитьОбласть(ТабДок.Область("R3C2"),Смещать);

    ТекстЗаголовка = "Лист исполнения к Разрешению МЗ РФ № "+Разрешение.Номер+ " от " + Формат(Разрешение.Issued,"ДФ=dd.MM.yyyy");
	//ТабДок.НижнийКолонтитул.НачальнаяСтраница = 1; 
	//ТабДок.НижнийКолонтитул.Выводить             = Истина;
	//ТабДок.НижнийКолонтитул.НачальнаяСтраница = 1; 
	//ТабДок.НижнийКолонтитул.Выводить             = Истина;
	//ТабДок.РазмерКолонтитулаСнизу                 = 12;
	//ТабДок.ПолеСверху                             = 10;
	//ТабДок.ПолеСнизу                             = 20;
	//ТабДок.ПолеСправа                            = 10;
	//ТабДок.ПолеСлева                            =10;
	//ТабДок.НижнийКолонтитул.ТекстСлева        = "Подпись_____________________";
	Область.Текст = ТекстЗаголовка;
	
	Область = ТабДок.ПолучитьОбласть("R4C1");
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	ТабДок.УдалитьОбласть(ТабДок.Область("R5C1:R12C2"),Смещать);
    НоваяОбласть = Новый ТабличныйДокумент;
	Секция = НоваяОбласть.ПолучитьОбласть("R1C3");
	Секция.Область("R1C3").Текст = "Подпись ___________";
	//Секция.Область("R1C3").Шрифт.Размер = 12;
	Табдок.Присоединить(Секция,,,);
	//Табдок.Показать();
	Табдок.Напечатать();
	 //Возврат
 КонецЦикла;
 
Иначе 
	
	
	
	ТабДок = Новый ТабличныйДокумент;
	Табдок = ПолучитьНаСервере(Объект.Разрешение);
	Табдок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Табдок.АвтоМасштаб = Истина;
	
	Область = ТабДок.НайтиТекст("Параметры");
	Смещать = ТипСмещенияТабличногоДокумента.ПоГоризонтали;
	ТабДок.УдалитьОбласть(Область, Смещать);
	
	Смещать = ТипСмещенияТабличногоДокумента.ПоГоризонтали;
	ТабДок.УдалитьОбласть(ТабДок.Область("R3C2"),Смещать);

	
    ТекстЗаголовка = "Лист исполнения к Разрешению МЗ РФ № "+Объект.Разрешение.Номер+ " от " + Формат(Объект.Разрешение.issued,"ДФ=dd.MM.yyyy");
	//ТабДок.НижнийКолонтитул.НачальнаяСтраница = 1; 
	//ТабДок.НижнийКолонтитул.Выводить             = Истина;
	//ТабДок.НижнийКолонтитул.НачальнаяСтраница = 1; 
	//ТабДок.НижнийКолонтитул.Выводить             = Истина;
	//ТабДок.РазмерКолонтитулаСнизу                 = 12;
	//ТабДок.ПолеСверху                             = 10;
	//ТабДок.ПолеСнизу                             = 20;
	//ТабДок.ПолеСправа                            = 10;
	//ТабДок.ПолеСлева                            =10;
	//ТабДок.НижнийКолонтитул.ТекстСлева        = "Подпись_____________________";
	Область.Текст = ТекстЗаголовка;
	
	Область = ТабДок.ПолучитьОбласть("R4C1");
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	ТабДок.УдалитьОбласть(ТабДок.Область("R5C1:R12C2"),Смещать);
    НоваяОбласть = Новый ТабличныйДокумент;
	Секция = НоваяОбласть.ПолучитьОбласть("R1C3");
	Секция.Область("R1C3").Текст = "Подпись ___________";
	//Секция.Область("R1C3").Шрифт.Размер = 12;
	Табдок.Присоединить(Секция,,,);
	//Табдок.Показать();
	Табдок.Напечатать();
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ПолучитьРазрешения();

Запрос = Новый Запрос;

Запрос.УстановитьПараметр("ДатаВывоза", НачалоДня(Объект.ДатаВывоза));

Запрос.Текст =  "ВЫБРАТЬ
                |	НакладныеОбразцы.Разрешение
                |ИЗ
                |	Документ.Накладные.Образцы КАК НакладныеОбразцы
                |ГДЕ
                |	НакладныеОбразцы.Ссылка.ДатаВывоза = &ДатаВывоза
                |
                |СГРУППИРОВАТЬ ПО
                |	НакладныеОбразцы.Разрешение" ;
				
Выгрузка = Запрос.Выполнить().Выгрузить();

Возврат Выгрузка.ВыгрузитьКолонку("Разрешение");

	
КонецФункции