
&НаСервере
Процедура СохранитьФайлНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаВывозаНачало",Объект.ДатаВывозаНачало);
	Запрос.УстановитьПараметр("ДатаВывозаКонец",Объект.ДатаВывозаКонец);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Накладные.Ссылка
	               |ИЗ
	               |	Документ.Накладные КАК Накладные
	               |ГДЕ
	               |	Накладные.Проведен
	               |	И Накладные.ДатаВывоза <= &ДатаВывозаКонец
	               |	И Накладные.ДатаВывоза >= &ДатаВывозаНачало";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Попытка
		Эксель = Новый COMОбъект ("Excel.Application"); 
	Исключение
		Сообщить(ОписаниеОшибки()); 
		Возврат;
	КонецПопытки; 
	Книга = Эксель.WorkBooks.Add();
	Лист = Книга.WorkSheets(1);
	Лист.Name = "Общий";
	НомерСтроки=1;
	//Лист.Cells(НомерСтроки, 1).Value = "№ Накладной";
	//Лист.Cells(НомерСтроки, 2).Value = "Описание отправки";
	//Лист.Cells(НомерСтроки, 3).Value = "Разрешения";
	//Лист.Cells(НомерСтроки, 4).Value = "Итого пробирок, шт";
	
	Пока Выборка.Следующий() Цикл
		
		ЗапросРаз = Новый Запрос;	
		ЗапросРаз.УстановитьПараметр("Ссылка",Выборка.Ссылка);
		ЗапросРаз.УстановитьПараметр("ДатаВывоза",Выборка.Ссылка.ДатаВывоза);
		ЗапросРаз.Текст = "ВЫБРАТЬ
		                  |	НакладныеОбразцы.Разрешение,
		                  |	СУММА(НакладныеОбразцы.Списание) КАК Списание,
		                  |	НакладныеОбразцы.Ссылка.Номер,
		                  |	НакладныеОбразцы.Разрешение.Номер,
		                  |	НакладныеОбразцы.Ссылка.ДатаВывоза,
		                  |	НакладныеОбразцы.Образец
		                  |ИЗ
		                  |	Документ.Накладные.Образцы КАК НакладныеОбразцы
		                  |ГДЕ
		                  |	НакладныеОбразцы.Ссылка.Проведен
		                  |	И НакладныеОбразцы.Ссылка.ДатаВывоза = &ДатаВывоза
		                  |	И НакладныеОбразцы.Ссылка = &Ссылка
		                  |
		                  |СГРУППИРОВАТЬ ПО
		                  |	НакладныеОбразцы.Разрешение,
		                  |	НакладныеОбразцы.Ссылка.Номер,
		                  |	НакладныеОбразцы.Разрешение.Номер,
		                  |	НакладныеОбразцы.Ссылка.ДатаВывоза,
		                  |	НакладныеОбразцы.Образец" ;
		
		ВыборкаРаз = ЗапросРаз.Выполнить().Выбрать();
		РазрешениеСтрока = "";
		Колонка3="";
		Списание = 0;
		ОписаниеОтправки = "";
		
		Пока ВыборкаРаз.Следующий() Цикл
			
			Если РазрешениеСтрока = "" Тогда
				РазрешениеСтрока = РазрешениеСтрока+ Строка(ВыборкаРаз.РазрешениеНомер);
			Иначе
				РазрешениеСтрока = РазрешениеСтрока + "\"+Строка(ВыборкаРаз.РазрешениеНомер);
			КонецЕсли;
			
			//Если Колонка3 = "" Тогда
			//	Колонка3 = Колонка3 + "РАЗРЕШЕНИЕ МЗ РФ № " +ВыборкаРаз.РазрешениеНомер+" ОТ "+Формат(ВыборкаРаз.Разрешение.issued, "ДФ=dd.MM.yy");
			//Иначе
			//	Колонка3 = Колонка3 + "\РАЗРЕШЕНИЕ МЗ РФ № " +ВыборкаРаз.РазрешениеНомер+" ОТ "+Формат(ВыборкаРаз.Разрешение.issued, "ДФ=dd.MM.yy");
			//КонецЕсли;
			
			Если ВыборкаРаз.Списание>0 тогда
				Если ОписаниеОтправки = "" Тогда
					ОписаниеОтправки = Строка(ВыборкаРаз.Образец)+" -"+ВыборкаРаз.Списание+" шт.";
				Иначе 
					ОписаниеОтправки = ОписаниеОтправки +"; "+Строка(ВыборкаРаз.Образец)+" -"+ВыборкаРаз.Списание+" шт.";
				КонецЕсли;
			КонецЕсли;
			//Списание = Списание+ВыборкаРаз.Списание;
			
		КонецЦикла;
		
		Лист.Cells(НомерСтроки, 1).Value = ВыборкаРаз.Номер;
		//Лист.Cells(НомерСтроки, 2).Value = РазрешениеСтрока;
		//Лист.Cells(НомерСтроки, 3).Value = Колонка3;
		//Лист.Cells(НомерСтроки, 4).Value = Списание;
		Лист.Cells(НомерСтроки, 2).Value = ОписаниеОтправки;
		
		НомерСтроки = НомерСтроки+1;	
	КонецЦикла;
	
	ПутьКФайлу = "\\rumows12\Файлы Разрешений\Выгрузка описаний отправок "+Формат(ТекущаяДата(),"ДФ=dd.MM.yy")+" "+ Формат(ТекущаяДата(),"ДФ=чч.мм")+".xlsx";
	
	Попытка
		Книга.SaveAs(ПутьКФайлу); 
	Исключение
		Сообщить(ОписаниеОшибки()+" Файл не сохранен!"); 
	КонецПопытки;
	
	Эксель.Application.Quit();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)
	СохранитьФайлНаСервере();
КонецПроцедуры
