
#Область ОбновлениеИнформационнойБазы

Функция СоздатьЛабораторию(ReceiverLAB) Экспорт

	//Лаборатория = Справочники.ПринимающаяЛаборатория.СоздатьЭлемент();
	//Лаборатория.Наименование = СокрЛП(ReceiverLAB);
	//Лаборатория.УстановитьНовыйКод();
	//
	//Попытка
	//	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Лаборатория);
	//	Возврат Лаборатория.Ссылка;
	//Исключение
	//	ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление информационной базы.Создание лаборатории'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки(),);
	//	Возврат ПредопределенноеЗначение("Справочник.ПринимающаяЛаборатория.ПустаяСсылка");
	//КонецПопытки;
	
КонецФункции

#КонецОбласти

