
#Область ОбновлениеИнформационнойБазы

Процедура ПерезаполнитьНаименование() Экспорт

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Доверенности.Ссылка
	//	|ИЗ
	//	|	Справочник.Доверенности КАК Доверенности";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	ЭлементСправочника = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	//	ЭлементСправочника.Наименование = СокрЛП(СтрЗаменить(ЭлементСправочника.Наименование, "Доверенность", ""));
	//	ЭлементСправочника.Записать();
	//КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
