
#Область ОбновлениеИнформационнойБазы

Функция СоздатьПотокол(СтарыйStudyNumber) Экспорт
	
	//Протокол = Справочники.Протоколы.СоздатьЭлемент();
	//Протокол.Наименование = СокрЛП(СтарыйStudyNumber);
	//Протокол.УстановитьНовыйКод();
	//
	//Попытка
	//	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Протокол);
	//	Возврат Протокол.Ссылка;
	//Исключение
	//	ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление информационной базы.Создание протоколов'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки(),);
	//	Возврат ПредопределенноеЗначение("Справочник.Протоколы.ПустаяСсылка");
	//КонецПопытки;
	
КонецФункции

#КонецОбласти
