
#Область ПрограммныйИнтерфейс

Функция ВыполнитьВФоне(Знач ИмяПроцедуры, Знач ПараметрыПроцедуры, Знач ПараметрыВыполнения) Экспорт
		
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

Процедура ВывестиСообщенияДлительнойОперации(ИдентификаторЗадания, ИдентификаторФормы = Неопределено) Экспорт
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если Задание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСообщений = Задание.ПолучитьСообщенияПользователю(Истина);
	Если МассивСообщений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Сообщение Из МассивСообщений Цикл
		Если ИдентификаторФормы <> Неопределено Тогда
			Сообщение.ИдентификаторНазначения = ИдентификаторФормы;
		КонецЕсли;
		Сообщение.Сообщить();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти