
#Область ОбновлениеИнформационнойБазы

Процедура ЗаполнитьРеквизитПолноеНаименование() Экспорт

	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Образцы.Ссылка КАК Образец
	//               |ИЗ
	//               |	Справочник.Образцы КАК Образцы
	//               |ГДЕ
	//               |	Образцы.ПолноеНаименование = """"";
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий()Цикл
	//	Образец = Выборка.Образец.ПолучитьОбъект();
	//	Образец.ПолноеНаименование = СокрЛП(Образец.Наименование);
	//					
	//	Попытка
	//		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Образец);
	//	Исключение
	//		ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление информационной базы.Заполнение резвизита ""Полное наименование""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки(),);
	//		Прервать;
	//	КонецПопытки;
	//	
	//КонецЦикла;	

КонецПроцедуры

#КонецОбласти
