#Область ПрограммныйИнтерфейс

Процедура ДобавитьАдресЭлектроннойПочтыКонтактногоЛица(Объект, Представление, УдалятьТекущийАдрес = Ложь) Экспорт
	
	Если УдалятьТекущийАдрес Тогда
		НайденныеСтроки = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица));
		Для Каждого СтрокаКУдалению Из НайденныеСтроки Цикл
			Объект.КонтактнаяИнформация.Удалить(СтрокаКУдалению);	
		КонецЦикла;
	КонецЕсли;
	
	Если ПустаяСтрока(Представление) Тогда
		Возврат;
	КонецЕсли;
	
	ВидИнформации = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
	ТипИнформации = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(Представление, ВидИнформации);
	
	УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(Объект, ЗначенияПолей, ВидИнформации, ТипИнформации);
	УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформациюДляСписков(Объект);
	
КонецПроцедуры

#КонецОбласти