
&НаСервере
Процедура СохранитьФайлНаСервере()
	
	//////////////Получаем список накладных для отображения
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаВывозаНачало",Объект.ДатаВывозаНачало);
	Запрос.УстановитьПараметр("ДатаВывозаКонец",Объект.ДатаВывозаКонец);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Накладные.Ссылка
	               |ИЗ
	               |	Документ.Накладные КАК Накладные
	               |ГДЕ
	               |	Накладные.Проведен
	               |	И Накладные.ДатаВывоза <= &ДатаВывозаКонец
	               |	И Накладные.ДатаВывоза >= &ДатаВывозаНачало";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	////////////Создаём файл Эксель
	Попытка
		Эксель = Новый COMОбъект ("Excel.Application"); 
	Исключение
		Сообщить(ОписаниеОшибки()); 
		Возврат;
	КонецПопытки; 
	
	Книга = Эксель.WorkBooks.Add();
	Лист = Книга.WorkSheets(1);
	Лист.Name = "Общий";
	НомерСтроки=2;
	Лист.Cells(1, 1).Value = "№ Накладной";
	Лист.Cells(1, 2).Value = "№ Разрешения";
	Лист.Cells(1, 3).Value = "Разрешения";
	Лист.Cells(1, 4).Value = "Итого пробирок, шт";
	Лист.Cells(1, 5).Value = "Остатки образцов по данному разрешению в шт.";
	
	////////////Создаем массив для записи уже показанных разрешений для избежания дублей
	МассивРазрешений = Новый массив;
	
	////////////Выбираем данные по накладной
	Пока Выборка.Следующий() Цикл
		
		ЗапросРаз = Новый Запрос;	
		ЗапросРаз.УстановитьПараметр("Ссылка",Выборка.Ссылка);
		ЗапросРаз.УстановитьПараметр("ДатаВывоза",Выборка.Ссылка.ДатаВывоза);
		ЗапросРаз.Текст = "ВЫБРАТЬ
		                  |	НакладныеОбразцы.Разрешение,
		                  |	СУММА(НакладныеОбразцы.Списание) КАК Списание,
		                  |	НакладныеОбразцы.Ссылка.Номер,
		                  |	НакладныеОбразцы.Разрешение.Номер,
		                  |	НакладныеОбразцы.Ссылка.ДатаВывоза
		                  |ИЗ
		                  |	Документ.Накладные.Образцы КАК НакладныеОбразцы
		                  |ГДЕ
		                  |	НакладныеОбразцы.Ссылка.Проведен
		                  |	И НакладныеОбразцы.Ссылка.ДатаВывоза = &ДатаВывоза
		                  |	И НакладныеОбразцы.Ссылка = &Ссылка
		                  |
		                  |СГРУППИРОВАТЬ ПО
		                  |	НакладныеОбразцы.Разрешение,
		                  |	НакладныеОбразцы.Ссылка.Номер,
		                  |	НакладныеОбразцы.Разрешение.Номер,
		                  |	НакладныеОбразцы.Ссылка.ДатаВывоза" ;
		
		ВыборкаРаз = ЗапросРаз.Выполнить().Выбрать();
		РазрешениеСтрока = "";
		Колонка3="";
		Списание = 0;
		ОстаткиОбразцов ="";
		
		///////////Заполняем данные по накладным, заполняем данные по нескольким накладным
		Пока ВыборкаРаз.Следующий() Цикл
			
			Если РазрешениеСтрока = "" Тогда
				РазрешениеСтрока = РазрешениеСтрока+ Строка(ВыборкаРаз.РазрешениеНомер);
			Иначе
				РазрешениеСтрока = РазрешениеСтрока + "\"+Строка(ВыборкаРаз.РазрешениеНомер);
			КонецЕсли;
			
			Если Колонка3 = "" Тогда
				Колонка3 = Колонка3 + "РАЗРЕШЕНИЕ МЗ РФ № " +ВыборкаРаз.РазрешениеНомер+" ОТ "+Формат(ВыборкаРаз.Разрешение.issued, "ДФ=dd.MM.yy");
			Иначе
				Колонка3 = Колонка3 + "\РАЗРЕШЕНИЕ МЗ РФ № " +ВыборкаРаз.РазрешениеНомер+" ОТ "+Формат(ВыборкаРаз.Разрешение.issued, "ДФ=dd.MM.yy");
			КонецЕсли;
			
			ЗапросДва = Новый Запрос;
			ЗапросДва.УстановитьПараметр("Разрешение",ВыборкаРаз.Разрешение);
			ЗапросДва.УстановитьПараметр("Период",ТекущаяДата());
			ЗапросДва.Текст =  "ВЫБРАТЬ
			                   |	ОстаткиПоКвотеОстатки.Образец,
			                   |	ОстаткиПоКвотеОстатки.КоличествоОстаток
			                   |ИЗ
			                   |	РегистрНакопления.ОстаткиПоКвоте.Остатки(&период, Разрешение = &Разрешение) КАК ОстаткиПоКвотеОстатки";
			
			ВыборкаДва = ЗапросДва.Выполнить().Выбрать();
			Если МассивРазрешений.Найти(ВыборкаРаз.Разрешение) = Неопределено	Тогда 
				
				ОстаткиОбразцов = "Остатки по разрешению "+ВыборкаРаз.РазрешениеНомер+ ":";	
				
				Пока ВыборкаДва.Следующий() Цикл
					ОстаткиОбразцов=ОстаткиОбразцов+ВыборкаДва.Образец+"-" +ВыборкаДва.КоличествоОстаток+" шт.;";
				КонецЦикла;
				
				МассивРазрешений.Добавить(ВыборкаРаз.Разрешение);
			КонецЕсли;
			
			Списание = Списание+ВыборкаРаз.Списание;
			
		КонецЦикла;	
		
		Лист.Cells(НомерСтроки, 1).Value = ВыборкаРаз.Номер;
		Лист.Cells(НомерСтроки, 2).Value = РазрешениеСтрока;
		Лист.Cells(НомерСтроки, 3).Value = Колонка3;
		Лист.Cells(НомерСтроки, 4).Value = Списание;
		Лист.Cells(НомерСтроки, 5).Value = ОстаткиОбразцов;
		НомерСтроки = НомерСтроки+1;
		
	КонецЦикла;
	
	ПутьКФайлу = "\\164.39.95.17\tntru\CIT\Разрешения\Выгрузка От "+Формат(ТекущаяДата(),"ДФ=dd.MM.yy")+" "+ Формат(ТекущаяДата(),"ДФ=чч.мм")+".xlsx";
	
	Попытка
		Книга.SaveAs(ПутьКФайлу); 
	Исключение
		Сообщить(ОписаниеОшибки()+" Файл не сохранен!"); 
	КонецПопытки;
	
	Эксель.Application.Quit();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)
	СохранитьФайлНаСервере();
КонецПроцедуры
