////////////////////////////////////////////////////////////////////////////////
// Подсистема "Печать".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует и выводит на экран печатные формы.
// 
// Параметры:
//  ИмяМенеджераПечати - Строка - менеджер печати для печатаемых объектов;
//  ИменаМакетов       - Строка - идентификаторы печатных форм;
//  МассивОбъектов     - Ссылка, Массив - объекты печати;
//  ВладелецФормы      - УправляемаяФорма - форма, из которой выполняется печать;
//  ПараметрыПечати    - Структура - произвольные параметры для передачи в менеджер печати.
//
Функция ВыполнитьКомандуПечати(ОписаниеКоманды) Экспорт
	
	Если ОписаниеКоманды.Свойство("ЗаголовокФормы") И ЗначениеЗаполнено(ОписаниеКоманды.ЗаголовокФормы) Тогда
		ПараметрыПечати = Новый Структура("ЗаголовокФормы", ОписаниеКоманды.ЗаголовокФормы);
	Иначе
		ПараметрыПечати = ПолучитьЗаголовокПечатнойФормы(ОписаниеКоманды.ОбъектыПечати);
	КонецЕсли;
	
	Если ОписаниеКоманды.Свойство("ДополнительныеПараметры") Тогда
		ПараметрыПечати.Вставить("ДополнительныеПараметры", ОписаниеКоманды.ДополнительныеПараметры);
	КонецЕсли; 
	
	Если ТипЗнч(ОписаниеКоманды.ОбъектыПечати) <> Тип("Массив")
		ИЛИ ОписаниеКоманды.ОбъектыПечати.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеКомандыПечати = Новый Структура;
	ОписаниеКомандыПечати.Вставить("МенеджерПечати", ОписаниеКоманды.МенеджерПечати);
	ОписаниеКомандыПечати.Вставить("Идентификатор", ОписаниеКоманды.Идентификатор);
	ОписаниеКомандыПечати.Вставить("ОбъектыПечати", ОписаниеКоманды.ОбъектыПечати);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОписаниеКоманды", ОписаниеКомандыПечати);
	ПараметрыФормы.Вставить("ПараметрыПечати", ПараметрыПечати);
	ПараметрыФормы.Вставить("ВладелецФормы", ПараметрыПечати.ЗаголовокФормы); 
	
	ОткрытьФорму("Документ.Разрешения.Форма.ФормаНастроекПечатиМанифеста", ПараметрыФормы, ОписаниеКоманды.Форма);
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗаголовокПечатнойФормы(ПараметрКоманды) Экспорт 
	
	Если Тип(ПараметрКоманды) = Тип("Массив") И ПараметрКоманды.Количество() = 1 Тогда 
		Возврат Новый Структура("ЗаголовокФормы", ПараметрКоманды[0]);
	Иначе
		Возврат Новый Структура;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
